src/InformationRegisters/ДиалогиНаСтанциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДиалогиНаСтанциях</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДиалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ЭлементыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЭлементыДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШаблоныДиалогов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭлементаДиалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующийЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДиалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияЭлементовДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаГостя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормы</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементыДиалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФормыГостя</Name>
					<Comment>Для подстановки в отображаемую форму</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныДиалогов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАктивности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПовторнойАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыПовторнойАктивации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныАктивности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныАктивности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПериодыАктивности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНач</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяКон</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Станции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расписание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндивидуальнаяНастройкаАктивности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Расписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Расписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоДнямНедели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыАктивности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНач</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяКон</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/УправлениеДиалогами/Ext/Module.bsl
Функция ПолучитьЭлементДиалогаПоТипу(ШаблонДиалога, Тип)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлементыДиалогов.Ссылка
	|ИЗ
	|	Справочник.ЭлементыДиалогов КАК ЭлементыДиалогов
	|ГДЕ
	|	ЭлементыДиалогов.Владелец = &ШаблонДиалога
	|	И ЭлементыДиалогов.ТипЭлементаДиалога = &ТипЭлементаДиалога
	|	И НЕ ЭлементыДиалогов.ПометкаУдаления");
	Запрос.УстановитьПараметр("ШаблонДиалога", ШаблонДиалога);
	Запрос.УстановитьПараметр("ТипЭлементаДиалога", Тип);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() Тогда
		Возврат Рез[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
КонецФункции // ПолучитьЭлементДиалогаПоТипу()

Функция ПолучитьСледующийЭлемент(Элемент)
	Если ЗначениеЗаполнено(Элемент.СледующийЭлемент) Тогда
		
		Возврат Элемент.СледующийЭлемент;
		
	КонецЕсли; 	
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭлементыДиалогов.Ссылка
	|ИЗ
	|	Справочник.ЭлементыДиалогов КАК ЭлементыДиалогов
	|ГДЕ
	|	ЭлементыДиалогов.Родитель = &Родитель
	|	И НЕ ЭлементыДиалогов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭлементыДиалогов.НомерПП");	
	Запрос.УстановитьПараметр("Родитель", Элемент);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() Тогда
		Возврат Рез[0].Ссылка;
	Иначе 
		Возврат Неопределено;	
	КонецЕсли; 
КонецФункции

Процедура Зарегистрировать(Заказ, Станция, ЭлементДиалога, Ответ=Неопределено)
	Нов = РегистрыСведений.ДиалогиНаСтанциях.СоздатьМенеджерЗаписи();
	Нов.Период = ТекущаяДата();
	Нов.Заказ = Заказ;
	Нов.Станция = Станция;
	Нов.ЭлементДиалога = ЭлементДиалога;
	Нов.Ответ = Ответ;
	Нов.Пользователь = глПользователь;
	Нов.ШаблонДиалога = ЭлементДиалога.Владелец;
	Нов.Записать();
КонецПроцедуры 

Функция АктивныеШаблоны(Станция, Дата, СобытиеАктивации = Неопределено)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ШаблоныДиалогов.ШаблонАктивности,
	|	ШаблоныДиалогов.ВариантПовторнойАктивации,
	|	ШаблоныДиалогов.Ссылка КАК ШаблонДиалога
	|ПОМЕСТИТЬ АктивныеШаблоны
	|ИЗ
	|	Справочник.ШаблоныДиалогов КАК ШаблоныДиалогов
	|ГДЕ
	|	ШаблоныДиалогов.Действует
	|	И ШаблоныДиалогов.СобытиеАктивации = &СобытиеАктивации
	|	И (ШаблоныДиалогов.СобытиеАктивации = &СобытиеАктивации
	|			ИЛИ ШаблоныДиалогов.СобытиеАктивации = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныАктивностиСтанции.Расписание,
	|	АктивныеШаблоны.ШаблонДиалога,
	|	АктивныеШаблоны.ВариантПовторнойАктивации
	|ПОМЕСТИТЬ Расписания
	|ИЗ
	|	АктивныеШаблоны КАК АктивныеШаблоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныАктивности.Станции КАК ШаблоныАктивностиСтанции
	|		ПО АктивныеШаблоны.ШаблонАктивности = ШаблоныАктивностиСтанции.Ссылка
	|ГДЕ
	|	ШаблоныАктивностиСтанции.Станция = &Станция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расписания.Расписание,
	|	Расписания.ШаблонДиалога,
	|	Расписания.ВариантПовторнойАктивации
	|ПОМЕСТИТЬ ДействующиеНаДеньНедели
	|ИЗ
	|	Расписания КАК Расписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Расписания.ДниНедели КАК РасписанияДниНедели
	|		ПО Расписания.Расписание = РасписанияДниНедели.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Расписания.ПериодыАктивности КАК РасписанияПериодыАктивности
	|		По РасписанияПериодыАктивности.Ссылка = Расписания.Расписание и (РасписанияПериодыАктивности.ДеньНедели = РасписанияДниНедели.ДеньНедели или РасписанияПериодыАктивности.ДеньНедели = ЗНАЧЕНИЕ(Перечисление.ДниНедели.ПустаяСсылка) )
	|ГДЕ
	|	РасписанияДниНедели.ДеньНедели = &ДеньНедели
	|	И РасписанияДниНедели.Действует
	|	И &ТекущееВремя Между РасписанияПериодыАктивности.ВремяНач и РасписанияПериодыАктивности.ВремяКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеНаДеньНедели.ВариантПовторнойАктивации,
	|	ДействующиеНаДеньНедели.ШаблонДиалога
	|ИЗ
	|	ДействующиеНаДеньНедели КАК ДействующиеНаДеньНедели
	|		
	|");
	Запрос.УстановитьПараметр("Станция", Станция);	
	Запрос.УстановитьПараметр("ДеньНедели", Перечисления.ДниНедели[ДеньНедели(Дата)-1]);	
	Запрос.УстановитьПараметр("СобытиеАктивации", СобытиеАктивации);	
	Запрос.УстановитьПараметр("ТекущееВремя", ВремяИзДаты(ТекущаяДата()));	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции 

Функция ДиалогДолженБытьАктивирован(Заказ, Станция, ШаблонДиалога, СобытиеАктивации, ВариантПовторнойАктивации)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблонДиалога", ШаблонДиалога);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Станция", Станция);
	Если ВариантПовторнойАктивации = Справочники.ВариантыПовторнойАктивации.НеКонтролировать Тогда
		Возврат Истина;
	ИначеЕсли ВариантПовторнойАктивации = Справочники.ВариантыПовторнойАктивации.НаКаждойСтанции Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДиалогиНаСтанциях.Заказ
		|ИЗ
		|	РегистрСведений.ДиалогиНаСтанциях КАК ДиалогиНаСтанциях
		|ГДЕ
		|	ДиалогиНаСтанциях.Заказ = &Заказ
		|	И ДиалогиНаСтанциях.Станция = &Станция
		|	И ДиалогиНаСтанциях.ШаблонДиалога = &ШаблонДиалога";
	ИначеЕсли ВариантПовторнойАктивации = Справочники.ВариантыПовторнойАктивации.ОдинРаз Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДиалогиНаСтанциях.Заказ
		|ИЗ
		|	РегистрСведений.ДиалогиНаСтанциях КАК ДиалогиНаСтанциях
		|ГДЕ
		|	ДиалогиНаСтанциях.Заказ = &Заказ
		|	И ДиалогиНаСтанциях.ШаблонДиалога = &ШаблонДиалога";

	КонецЕсли; 
	Возврат Запрос.Выполнить().Пустой();
КонецФункции // ДиалогДолженБытьАктивирован()
 
Процедура ОбработкаСобытияАктивации(ОбработкаЗаказ, СобытиеАктивации)
	Заказ = ОбработкаЗаказ.Заказ.Ссылка;
	Станция = глРабочееМесто.Станция;
	АктивныеШаблоны = АктивныеШаблоны(Станция, ТекущаяДата(), СобытиеАктивации);	
	Для каждого Т Из АктивныеШаблоны Цикл
		Если ДиалогДолженБытьАктивирован(Заказ, Станция, Т.ШаблонДиалога, СобытиеАктивации, Т.ВариантПовторнойАктивации) Тогда
		    Попытка
				АктивироватьДиалог(ОбработкаЗаказ, Станция, Т.ШаблонДиалога, СобытиеАктивации, Т.ВариантПовторнойАктивации);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				Сообщить(ОписаниеОшибки());
				ЗаписьЖурналаРегистрации("Управление диалогами", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ШаблоныДиалогов, Т.ШаблонДиалога, "Ошибка при активации диалога: " + ОписаниеОшибки() + Символы.ПС + ОписаниеОшибки);		
			КонецПопытки;
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбработатьЭлементДиалога(Элемент, ОбработкаЗаказ, Станция)
	Заказ = ОбработкаЗаказ.Заказ.Ссылка;
	Ответ = Неопределено;
	Если ЗначениеНеЗаполнено(Элемент) Тогда
		ЗаписьЖурналаРегистрации("Управление диалогами", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ШаблоныДиалогов, Неопределено, "Ошибка: элемент диалога неопределен");
		Возврат;
		Элемент = Справочники.ЭлементыДиалогов.СоздатьЭлемент().Ссылка;
	КонецЕсли; 

	Если Не Элемент.ФормаГостя.Пустая() И Не Элемент.ФормаГостя = Справочники.ФормыДиалогов.СтандартнаяФормаЗаказа Тогда
		ФормаГостяОбъект = Элемент.ФормаГостя.ПолучитьОбъект();
		
		ФормаГостяОбъект.ПараметрыФормы = Элемент.ПараметрыФормыГостя.Выгрузить();
		ФормаГостя = ФормаГостяОбъект.ПолучитьФорму(ФормаГостяОбъект.Форма);
		ФормаГостя.СостояниеОкна = ВариантСостоянияОкна.Свободное;
		ФормаГостя.Открыть();
	КонецЕсли; 
	Если Не Элемент.Форма.Пустая()  И Не Элемент.Форма = Справочники.ФормыДиалогов.СтандартнаяФормаЗаказа Тогда
		ФормаОбъект = Элемент.Форма.ПолучитьОбъект();
		
		Если Элемент.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
			ФормаОбъект.ВариантыОтветов = Элемент.ВариантыОтветов.Выгрузить();	
		КонецЕсли; 
		ФормаОбъект.ПараметрыФормы = Элемент.ПараметрыФормы.Выгрузить();
		Форма = ФормаОбъект.ПолучитьФорму(ФормаОбъект.Форма);
		Ответ = Форма.ОткрытьМодально();
	КонецЕсли; 	
	
	Зарегистрировать(Заказ, Станция, Элемент, Ответ);
	
	Если Элемент.ТипЭлементаДиалога = Справочники.ТипыЭлементовДиалогов.Вопрос Тогда
	
		СтрокаОтвета = Элемент.ВариантыОтветов.Найти(Ответ);
		Если СтрокаОтвета = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Управление диалогами", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ЭлементыДиалогов, Элемент, "Ошибка: ответ не найден среди вариантов (" + Ответ + ")");	
		Иначе 
			СледующийЭлемент = СтрокаОтвета.ВариантОтвета;
			ОбработатьЭлементДиалога(СледующийЭлемент, ОбработкаЗаказ, Станция);
		КонецЕсли; 
		
		
	ИначеЕсли Элемент.ТипЭлементаДиалога <> Справочники.ТипыЭлементовДиалогов.Конец И
		 Элемент.ТипЭлементаДиалога <> Справочники.ТипыЭлементовДиалогов.Выход Тогда
		 
		 Если Элемент.Действие = Справочники.ДействияЭлементовДиалогов.ДобавитьТоварВЗаказ Тогда
			 Если ЗначениеЗаполнено(Элемент.ПараметрДействия) Тогда
			 
				ОбработкаЗаказ.ВводНовойСтроки(Элемент.ПараметрДействия, 1);	 	
			 
			 КонецЕсли;
		 КонецЕсли;
		 
	
		СледующийЭлемент = ПолучитьСледующийЭлемент(Элемент);
		ОбработатьЭлементДиалога(СледующийЭлемент, ОбработкаЗаказ, Станция);
	
	
	КонецЕсли; 
			
КонецПроцедуры 

Процедура АктивироватьДиалог(ОбработкаЗаказ, Станция, ШаблонДиалога, СобытиеАктивации, ВариантПовторнойАктивации)
	Старт = ПолучитьЭлементДиалогаПоТипу(ШаблонДиалога, Справочники.ТипыЭлементовДиалогов.Старт);	
	Если Старт = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Управление диалогами", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ШаблоныДиалогов, ШаблонДиалога, "Не удалось активировать диалог: отсутствует элемент диалога типа ""Старт""");
		Возврат;	
	КонецЕсли; 
	Зарегистрировать(ОбработкаЗаказ.Заказ.Ссылка, Станция, Старт);
	
	ОбработатьЭлементДиалога(ПолучитьСледующийЭлемент(Старт), ОбработкаЗаказ, Станция);
КонецПроцедуры 


Процедура ПриОткрытииЗаказаНаСтанции(ОбработкаЗаказ) Экспорт
	ОбработкаСобытияАктивации(ОбработкаЗаказ, Справочники.СобытияАктивации.ПриОткрытииЗаказаНаСтанции);
КонецПроцедуры 

Процедура ПриСохраненииЗаказаНаСтанции(ОбработкаЗаказ) Экспорт
	ОбработкаСобытияАктивации(ОбработкаЗаказ, Справочники.СобытияАктивации.ПриСохраненииЗаказаНаСтанции);
КонецПроцедуры
